{"_id":{"$oid":"5b2cf0c15d9feb91dbeb846b"},"name":"Avatar","description":"A good movie based on socienty culture regarding women","actor":["Shahrukh Khan","Salman Khan"],"actress":["Tina Bhatt"],"releaseDate":2014.0,"director":"Chetan","rating":5.0,"genres":["Comedy"],"url":"http://localhost:8081/5b2cf0c15d9feb91dbeb846bAvatar.jpg","country":"India","id":1.0}
{"_id":{"$oid":"5b2cf828dffc770970727481"},"name":"3 idiot","description":"Chetan Bhagat's best-selling novel 5 Point Someone makes the leap to the big screen in this comedy about three engineering students whose friendship stands the test of time. As Farhan (R. Madhavan) and Raju (Sharman Joshi) search the valleys for their missing friend Rancho (Aamir Khan), their memories drift back to the days when they we're all college roommates, and Rancho incurred the wrath of their headstrong dean Viru Sahastrabudhhe (aka Virus) (Boman Irani) by daring to propose radical theories that directly contradicted his teacher's lessons","actor":["Amir Khan","Boman Irani"],"actress":["Kareena kapoor"],"releaseDate":{"$date":"2015-12-09T21:05:00.000Z"},"director":"Chetan","rating":3.0,"genres":["Comedy"],"url":"http://localhost:8081/5b2cf828dffc770970727481_3_idiot.jpg","country":"India","id":2.0}
{"_id":{"$oid":"5b2cf962dffc77097072748a"},"name":"Iron Man 3","description":"From Marvel Studios and Paramount Pictures comes Iron Man, an action-packed take on the tale of wealthy philanthropist Tony Stark (Robert Downey Jr.), who develops an invulnerable robotic suit to fight the throes of evil. In addition to being filthy rich, billionaire industrialist Tony Stark is also a genius inventor. When Stark is kidnapped and forced to build a diabolical weapon, he instead uses his intelligence and ingenuity to construct an indestructible suit of armor and escape his captors","actor":["Tim"],"actress":["Priyanka Chopra"],"releaseDate":{"$date":"2015-12-09T21:05:00.000Z"},"director":"Jeremy Wheeler","rating":5.0,"genres":["Action"],"url":"http://localhost:8081/5b2cf962dffc77097072748aIronMan3.jpg","country":"USA","id":3.0}
{"_id":{"$oid":"5b2cfa43dffc77097072748c"},"name":"Titanic","description":"This spectacular epic re-creates the ill-fated maiden voyage of the White Star Line's $7.5 million R.M.S Titanic and the tragic sea disaster of April 15, 1912. Running over three hours and made with the combined contributions of two major studios (20th Century-Fox, Paramount) at a cost of more than $200 million, Titanic ranked as the most expensive film in Hollywood history at the time of its release, and became the most successful. Writer-director James Cameron employed state-of-the-art digital special effects for this production, realized on a monumental scale and spanning eight decades. Inspired by the 1985 discovery of the Titanic in the North Atlantic, the contemporary storyline involves American treasure-seeker Brock Lovett (Bill Paxton) retrieving artifacts from the submerged ship.","actor":["Tim"],"actress":["Priyanka Chopra"],"releaseDate":{"$date":"1997-12-09T21:05:00.000Z"},"director":" James Cameron","rating":5.0,"genres":["Epic","Romance","Drama"],"url":"http://localhost:8081/5b2cfa43dffc77097072748cTitanic.jpg","country":"USA","id":4.0}
{"_id":{"$oid":"5b2fd48f4cbb052440aaf1bb"},"name":"Sholay ","description":"This 1975 film provides a superb look at popular Hindi cinema. Although it can be called an adventure, it has a spaghetti-western storyline, martial-arts sequences, comedy, soap-opera melodrama, and even musical numbers, including an early scene that has the two main characters riding a motorcycle and singing like Elvis Presley in the carnival flick, Roustabout. The film itself is indeed a carnival, and many of the features produced by India's popular movie industry exhibit a similar mixture of ingredients in an attempt to meet the audience's every possible expectation. Veeru (Dharmendra) and Jaidev (Amitabh Bachchan) are two small-time troublemakers who, in the past, have run afoul of Thakur Baldev Singh (Sanjeev Kumar); the Thakur, a former law officer, has seen the pair's heroic nature despite their criminal ways.","actor":["Dharmendra","Sanjeev Kumar"],"actress":["Hema Malini"],"releaseDate":1975.0,"director":"Ramesh Sippy","rating":4.0,"genres":["Action","Romance"],"url":"http://localhost:8081/Sholey.jpg","country":"India","id":5.0}
{"_id":{"$oid":"5b2fd6754cbb052440aaf1bc"},"name":"Veer-Zaara ","description":"A star-crossed love affair has political as well as emotional repercussions in this Bollywood romantic drama. Veer Pratap Singh (Shah Rukh Khan) is an officer and pilot in the Indian Air Force who one day meets a beautiful Pakistani heiress, Zaara Hayaat Khan (Preity Zinta), as she travels to a small Indian village to scatter the ashes of one of her family's loyal servants. Veer has family in the village, and while most Indians show no affection for Pakistanis, his aunt and uncle are willing to take Zaara in for the night. It isn't long before Veer finds himself falling for her; however, Veer learns that Zaara is engaged to another man, Raza (Manoj Bajpai), a cruel and humorless Pakistani.","actor":["Shahrukh Khan"],"actress":["Preeti Zinta"],"releaseDate":2004.0,"director":"Yash Chopra","rating":3.0,"genres":["Musical","Romance"],"url":"http://localhost:8081/VeerZara.jpg","country":"India","id":6.0}
{"_id":{"$oid":"5b2fd87e4cbb052440aaf1bd"},"name":"Swades","description":"A man searching for clues to his past pays a visit to the place where he was born in this drama laced with romance and music from India. Mohan Bhargava (Shah Rukh Khan) left the small village in India where he was born and raised to travel to the United States, where he worked as part of the American space program. But after the death of his parents, Mohan becomes nostalgic for his home and takes a leave of absence in order to visit Kaveri (Kishori Ballal), a woman who helped to raise him as a boy. While searching for Kaveri, Mohan becomes reacquainted with Gita (Gayatri Joshi), one of his friends from his school days","actor":["Shahrukh Khan"],"actress":["Preeti Zinta"],"releaseDate":2004.0,"director":"Yash Chopra","rating":3.0,"genres":["Musical","Drama"],"url":"http://localhost:8081/Swades.jpg","country":"India","id":7.0}
{"_id":{"$oid":"5b2fddf2ffe55e096cbfc35e"},"name":"Umrao Jaan","description":"Writer-director-producer J.P. Dutta authored the Indian period drama Umrao Jaan - the epic, three-hour story of a prostitute's travails in 19th century India. Aishwarya Rai stars as the title character; as the film opens, she is an elderly courtesan detailing her life for the benefit of the belletrist Mirza Mohammed Hada Ruswa who plans to document the woman's story for successive generations. As Umrao narrates, the film then flashes back to well over a half-century earlier, when she - originally a young girl, named Ameeran - is born comfortably into an affluent upper middle-class family in the city of Faizabad, Uttar Pradesh. Ameeran's path collides with destiny when she is kidnapped at a tender age by her father's enemies, promptly sold into a kotha (or brothel) in the city of Lucknow, and renamed Umrao Jaan. Her superiors teach her music, poetry and dance as part of her courtesan training; when herdebut finally arrives as a courtesan, the gods are with her, for a young aristocrat, Nawab Sultan (Abhishek Bachchan) falls instantly","actor":["\u0009Naseeruddin Shah"],"actress":["Umrao Jaan"],"releaseDate":1999.0,"director":"Muzaffar Ali","rating":3.0,"genres":["Musical","Drama"],"url":"http://localhost:8081/UmraoJaan.jpg","country":"India","id":8.0}
{"_id":{"$oid":"5b2fdea4ffe55e096cbfc35f"},"name":"Mujhse Dosti Kroge","description":"Young Raj and his parents depart their Indian town for London's Hampstead, where e-commerce is apparently booming. Modern technology is, however, only a thin veil for a staunchly old-fashioned Hindi musical rom com. When Raj returns 15 years later (now played by chiseled Roshan), he's reunited with flighty childhood crush Tina (Kapoor), with whom he's kept contact via e-mail - unaware that the heartfelt messages have actually been written by sweet, studious friend Pooja (Mukherjee).","actor":["Hrithik Roshan"],"actress":["Kareena Kapoor"],"releaseDate":1999.0,"director":"Muzaffar Ali","rating":3.0,"genres":["Musical","Romance"],"url":"http://localhost:8081/Dosti.jpg","country":"India","id":9.0}
{"_id":{"$oid":"5b2fdf60ffe55e096cbfc360"},"name":"Bhaag Milkha Bhaag","description":"Known as ‘The Flying Sikh’, India’s Milkha Singh almost won the 400 metres final at the 1960 Rome Olympics. But just as Singh was about to triumph, he lost his concentration and ended up coming fourth. Singh’s defeat was regarded as a national disgrace by a newly independent nation that was still struggling to find its feet and had placed high hopes on Singh’s Olympic victory.This biopic opens with images of Indians burning effigies of their fallen hero. It then charts the unconventional extraordinary life of the legendary, sometimes barefooted sprinter. It moves from his traumatic childhood during the 1947 partition of India to his eventual return as an adult to his old home in Pakistan.","actor":[" Priyadarshan"],"actress":["Sonam Kapoor"],"releaseDate":2013.0,"director":"Farhan Akhtar","rating":3.0,"genres":["Comedy","Romance","Drama"],"url":"http://localhost:8081/Bhaag.jpg","country":"India","id":10.0}
